#include <iostream>

int main() {
    int a1[3][4]={{1,2,3,4},{5,6,7,8},{10,11,12}};

    /*********
     1  2   3   4        (0,0) (0,1) (0,2) (0,3) 
     5  6   7   8        (1,0) (1,1) (1,2) (1,3)
     9  10  11  12,坐标:  (2,0) (2,1) (2,2) (2,3)
     *********
     */

    int(*p)[4]=a1;//定义方式，数据类型(*)[4]
    for(int i=0;i<3;i++)
    {
        for(int j=0;j<4;j++)
            std::cout<<*(*(p+i)+j)<<" ";
        std::cout<<std::endl;
    }

    int* p1=&a1[0][0];//指针指向多维数组的第一个元素地址，多维数组按每一行保存首尾相接保存在线型内存中，即通过 位置=（行数-1）*列数+第几列 就可线性遍历整个多维数组
    for(int i=0;i<3;i++)
    {
        for(int j=0;j<4;j++)
            std::cout<<*(p1+i*4+j)<<" ";//三行四列位置数据，即：数组首地址+（4*（3-1）+4）=12，线性坐标12，逻辑坐标（3,4），数据是12
        std::cout<<std::endl;
    }

    std::cout << "Hello, World!" << std::endl;
    return 0;
}
